Backend/tests/socket-high-load.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 300 
      arrivalRate: 10
      rampTo: 20
      name: Warm up phase
    - duration: 300
      arrivalRate: 20
      rampTo: 30
      name: Ramp up load
    - duration: 300
      arrivalRate: 30
      rampTo: 40
      name: Spike phase

scenarios:
  - name: "Main Namespace test 2"
    engine: socketio # Enable the Socket.IO engine
    flow:
      - namespace: '/chat'
        emit:
          on: "message"
          data: 
            - "أانا عاوز اكل ابعتلى المينو"
            - "عندك فراخ شاوريما و سندوتشات كوفتا"
            - "العنوان 12 شارع ابوقير الابراهيمية الاسكندرية"
            - "رقم التليفون 01234567890"
            - "عندكم خدمة توصيل"
            - "عندكم حواوشى حجم كبير ولا لا ؟"

  - name: "Restaurant Namespace test 2"
    engine: socketio
    flow:
      - namespace: '/restaurant'
        emit:
          on: "order"
          data: 
            - "Order: 123 name: Pizza quantity: 2 state: recieved"
            - "Order: 124 name: Burger quantity: 1 state: finished"