Backend/tests/socket-load-restaurant.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 300 
      arrivalRate: 5
      rampTo: 15
      name: Warm up phase
    - duration: 300
      arrivalRate: 15
      rampTo: 20
      name: Ramp up load
    - duration: 300
      arrivalRate: 20
      rampTo: 30
      name: Spike phase

scenarios:
  - name: "Restaurant Namespace test 1"
    engine: socketio
    flow:
      - namespace: '/restaurant'
        emit:
          on: "order"
          data: 
            - "Order: 123 name: Pizza quantity: 2 state: recieved"
            - "Order: 124 name: Burger quantity: 1 state: finished"